# здесь хранятся значения категориальных признаков книги и названия столбцов для них
column_vals_ = [
    [ "Твердый" ,
      "Мягкий"] ,

    ["А4",
     "А5"],

    ["Да",
     "Нет"],

    ["Клеевое",
     "Сшитое"],

    ["Черно-белый",
     "Цветной"],

    ["Да",
     "Нет"],
]
# 'Количество книг','Количество страниц'
columns_categ = ['Тип обложки' , 'Формат' , 'Выборочный лак' ,
                 'Скрепление блока' , 'Цветность блока' , 'Печать на экобумаге', 'Количество книг','Количество страниц','Цена']